{
    "name" : "normalize", 
    "description" : "Mathematically, normalization scales the intensity of image pixels relative to a given normalization value (typically 1) and type (typically NORM_L2). Normalization provides a valuable standard of comparison and is implemented by OpenCV normalize. Normalization can also be used for contrast shifting and scaling to focus on \"pixel values of interest\" and is a great visual aid for interpreting images. FireSight extends OpenCV with a domain parameter that lets you choose a range of pixel intensities of interest (see Example 3).",
    "parameters" : [
	    { 
	       "name":"alpha",
	       "default":1,
	       "description":"Norm value to normalize to or the lower range boundary in case of the range normalization. Default is 1 unless image is 8-bit, in which case FireSight will automatically compute a good value."
	    }, 
	    {
	       "name":"beta",
	       "default":1,
	       "description":"Upper range boundary in case of the range normalization; it is not used for the norm normalization. Only used for NORM_MINMAX."
	    }, 
	    {
	       "name":"normType",
	       "default":"NORM_L2",
	       "options":[
	       		"NORM_L2",
	       		"NORM_L1",
	       		"NORM_INF",
	       		"NORM_MINMAX"
	       ],
	       "description":"normalization type (NORM_L2 (default), NORM_L1, NORM_MINMAX, NORM_INF)."
	    },
	    {
	       "name":"domain",
	       "default":[],
	       "description":"JSON array of integers describing value interval to normalize. Default is [0,255]. Values outside this interval will be eliminated from pipeline image by truncating and shifting image values. This works for all normalization types and is useful for focusing on a value interval of interest."
	    }, 
	    {
	       "name":"range",
	       "default":[],
	       "description":"JSON array of integers describing output value interval. Default is [0,255], which maximizes the dynamic range of the normalized output. This is rarely used."
	    }
    ]
}